tutorials/DNS/dnsFoam/boxTurb16/0.org/enstrophy
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      enstrophy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    patch0
    {
        type            cyclic;
        value           uniform 0;
    }
    patch1
    {
        type            cyclic;
        value           uniform 0;
    }
    patch2
    {
        type            cyclic;
        value           uniform 0;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
