tutorials/DNS/dnsFoam/boxTurb16/Allrun.py.in
#!@PYTHON_EXECUTABLE@

import sys
import os
import os.path
sys.path.insert(0, '@FOAM_PYTHON_DIR@')
from FreeFOAM.compat import *
import FreeFOAM.tutorial
import FreeFOAM.util

class dnsBoxTurb16Runner(FreeFOAM.tutorial.CaseRunner):
   def __init__(self):
      FreeFOAM.tutorial.CaseRunner.__init__(self, 'dns_boxTurb16')
      self.add_app_step('blockMesh')
      self.add_app_step('boxTurb')
      self.add_app_step('dns')
      self.add_app_step('enstrophy')

   def clean(self):
      FreeFOAM.tutorial.CaseRunner.clean(self)
      FreeFOAM.util.copytree(
            os.path.join(self.case_dir, '0.org'),
            os.path.join(self.case_dir, '0'))

if __name__ == '__main__':
   os.chdir(os.path.abspath(os.path.dirname(sys.argv[0])))
   runner = FreeFOAM.tutorial.TutorialRunner()
   runner.add_case(dnsBoxTurb16Runner())
   sys.exit(runner.main())

# ------------------- vim: set sw=3 sts=3 ft=python et: ------------ end-of-file
