tutorials/DNS/dnsFoam/boxTurb16/constant/polyMesh/boundary
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    patch0
    {
        type            cyclic;
        nFaces          512;
        startFace       11520;
        featureCos      0.9;
    }
    patch1
    {
        type            cyclic;
        nFaces          512;
        startFace       12032;
        featureCos      0.9;
    }
    patch2
    {
        type            cyclic;
        nFaces          512;
        startFace       12544;
        featureCos      0.9;
    }
)

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
